rnc/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "postman test3"], ["image_url", "www.google.com"], ["artist_id", 1], ["created_at", "2022-09-15 21:09:39.373212"], ["updated_at", "2022-09-15 21:09:39.373212"]]
---
    def create
        @artwork = Artwork.new(artwork_params) #it won't create if the parameters are incorrect

        if @artwork.save #validation / constraints

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]
---
    def destroy
        @artwork = Artwork.find_by(id: params[:id]) #return found value or null
        if @artwork
            @artwork.destroy

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "updated title"], ["image_url", "www.google.com"], ["artist_id", 1], ["updated_at", "2022-09-15 21:17:34.760155"], ["id", 2]]
---
    def update
        @artwork = Artwork.find_by(id: params[:id])
        if @artwork.update(artwork_params)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
        @artwork = Artwork.find_by(id: params[:id])