rnc/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Bob"], ["created_at", "2022-09-15 18:08:44.625188"], ["updated_at", "2022-09-15 18:08:44.625188"]]
---
    def create
        @users = User.new(user_params)
        if @users.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        @user = User.find_by(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
    def destroy
        @user = User.find_by(id: params[:id])
        if @user
            @user.destroy